{"pages":[{"title":"","text":"[{\"name\":\"DASHENG-900x700-1.png\",\"date\":1518959551960},{\"name\":\"DASHENG-900x700-2.png\",\"date\":1518959599098},{\"name\":\"DASHENG-900x700-3.png\",\"date\":1518959609913},{\"name\":\"DASHENG-900x700-4.png\",\"date\":1518959618105}]","link":"/hexo-admin-ehc-images.json"},{"title":"about","text":"Hello. My name is James Tsui from Singapore. Over here, we have conscription, so I’m serving my 2 years of National Service. Before that, I was doing my diploma in Business Informatics at Nanyang Polytechnic. I can programme, especially javascript stuff — been participating in hackathon to further my skills and expose myself into the startup ecosystem. Right now I’m contemplating about life, a shared endeavour of people roughly the same age as me. So that was this website for. To contemplate. Here’s a summary I wrote a few months ago in case I were to create a platform to share my thought I’m using this platform to formulate my throughs. I realised that understanding a topic implicitly and expressing it explicitly are two different nature. The problem for me when trying to explain something is 1. there were gaps in my knowledge 2. the other individual has a pre-supposition that is different from mine.","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"A History of Religious Ideas from Antiquity","text":"We’re take a brief look at the history of religious idea and their development.To be continued… PaleanthropiansWe should not underestimate the development of religious idea. Right at the start of human consciousness, we express our creativity and try to conceptualize the world around us (back as earlier as 30,000 BCE). Archeologists discovery is in the material sense. The ideologies, ritual, practice is forever lost and up to the interpretation. As humans, we need to shelter ourselves. It could be that we simplify reality into symbolic representations, classify, categories, make it understandable so that the group can work towards the same goal? Or it could be that we need meaning in our lives and resorting to some divinity is inevitable. List of ritual Acts/Beliefs Ritual drama before briuel Animal can be reborn from its bone (The Jerusalem Bible) Religion of the cave Shamanism during the Paleolithic period Female &amp; Males geometric signs (Leroi-Gourhan) Paleolithic signs and figures represent stories (Marshak) Agriculture- Mesolithic and NeolithicThe Ice Age (8000 BCE) marks the transition into the Agricultural era where human moved to the domestication of animal and farming. Human’s creativity leads to the creation of new tools for cultivation. However, unlike today’s rational and empirical era, human attach mythological association to their figurative or geometric creations. There’s a divergence in society as human escape the confound of the cave and explore into different regions. Maybe it’s due to the limitation in our capacity to organise ourselves. At a certain threshold, groups split into different groups as they choose to cooperate or fight one another when encountered. The idea of dichotomy can be found here where it probably has a cosmological meaning (sky and earth, masculine and feminine, etc.). This thinking has manifested itself in today’s philosophy as well. What worries me is the post-structuralist way where everything can be deconstructed and redefined. Is it possible that we could transcend our pre-modern thinking, or will it lead to a regression? (To further research) List of ritual Acts/Beliefs The first military organisation took shape as guardian or hunters Raw meat eaters (Omophagia - worship of Dionysus) Myth of Hainuwele Female rise in social position as they are responsible for the mysteries of creation in harvesting (Hera’s mythology) The Cosmic Tree Mythology (Life-Death-PostExistence) Construction of temples and family chapel (Jericho) Cult of skulls Iron AgeThe creation of furnace brings an evolution in mythological and religious thinking. Back in the agriculture era, human worship the earth as Mother Nature and the source of harvesting. It is where the origin of life comes to be (association with the Mother’s womb). The caves and mines are a representation of the womb of Mother Earth. For metallurgy, the creation of the furnace opens up the new job possibility; the blacksmith. Now, human can perfect the ore, which means in a cosmological sense, men are now responsible for the creation of men. This can be interpreted as such; where the divine smiths forge the weapons of the gods and slay the dragon. In Egyptian version of the myth, Ptah (the potter god) forges the weapons and enable Hocus to conquer Seth. Hephaestus forges the thunderbolt that will enable Zeus to triumph over Typhon. The divine smith Tastr makes Indra’s weapons for his battle with Vrtra. This shift is ideas and beliefs are articulated around the trades of miners, metallurgists and smiths The Mesopotamian ReligionsThe Sumerian is said to be the earliest civilisation to document their myth. Here we have a story of the Enuma Elish where Dr Jordon Peterson used for his construction of symbolic representation in his book “Maps of Meaning”. The story flows like this: Tiamat (femininity) and Apsu(masculinity) are the primordial beings, representing the sea and mass of fresh water. From their mixture, other divine beings were born. As times passes, the tension between the gods grew and Apsu was executed. Tiamet reacted by forming monsters and bestow Kingu as their leader. Fearing defeat, the gods resort on sacrificing their power to rely on Marduk to confront Tiamat and Kingu. Marduk won the battle and created the world out of Tiamat’s organ. Finally, Maruk decides to create mankind from his blood for mankind shall service the gods. At Babylon, civilisation performs ritual closely resembling the Enuma Elish. With reference from Dr Jordan Peterson, civilisation forms into a hierarchy, but strangely the king is never at the top. He is still subordinate to the gods. On the day of a New Year, he expiates himself by declaring his innocence and is rewarded with a hierodule personifying as the goddess, metaphorically meaning the recreation of the world. The king is the personification of the gods that acts as a mediator between the world of men and the world of gods. Here we can track the evolution of the religious idea. The Neolithic influences the Sumerian to an extent in terms of the patterns/narrative of the belief, and it’s passed further down to Greece thinking. The patterns stayed similar. However, the characters of the story defer. Why is that? (En-lil during Mesopotamia &gt; Marduk during Babylon &gt; Shamash) List of ritual Acts/Beliefs Enuma Elish The Platonic Idea - preexistence of words and institutions Flood Myth to symbolises a New Year (Story of Noah) Epic of Gilgamesh Egyptian CivilisationThe Egyptian structure society as the centre of the world. If we look at the definition of Truth during this age. Truth is “Order” or “Good Justice”. What this means is whether law imposed on society, it is deemed as the Absolute Truth. We know during Mesopotamia age, civilisation structure is hierarchical, so is the Egyptian. At the top of the hierarchy, we have the pharaoh, the personification and mediator between man and god. Men can access the Absolute Truth through the pharaoh. Whether that is not the Truth is the symbolic representation of disorder, “chaos” or “Darkness.” At a point, Egypt went through a civil war and the state collapsed, along with the collapse of the traditional values. The Egyptian descend into scepticism. There was a theme of agnosticism and pessimism that is the result of that scepticism. We can tell this from the writing during the time (The Song of the Harper, Dispute of a Man Weary of Life, etcetc.) Here’s a description of the main mythological theme in Egypt as a result of this intermediation period. (explanation) Megalithic PeriodIn the Indian Myth, Men structure their life around the ‘banana’ when gods offer the fruit to Men. We can see a common similarity in how men structure themselves. The Object or Subject with a connection with a higher being is the main focus of society. Men define life with Truth, the association with God, and based their lives around this Object/Subject. What changes in the Megalithic period is that there is positive association with Death compared to the previous period. The ritual performed for Death is to ready the person for the transition into postexistence (whether it may be). The most ancient cities (China, Mestomia, Egypt) build around sanctuaries, close to a sacred space, a “Center of the World| where communication between earth, heaven and the subterranean was deemed possible. We have several secularized civilization here. The Harappa is the first modern secularized civilization of India where we will focus on for the history of Hinduism. However, throughout a few centuries, the Harappan was attacked by Aryan Invaders. It synthesis the re-culturalization of mythological/religious phenomenon bough by the Aryan. This gave further influence during the Hellenic age. List of ritual Acts/Beliefs Stonehenge Myth of the Minotaur Hinduism","link":"/2019/06/12/A-History-of-Religious-Ideas-Mircea-Eliade/"},{"title":"Postmodernism through a Postmodernist Lens","text":"The way we perceive the world around us has an underlying structure. That structure comes from philosophy, written by PhD professors in the past or contemporary. People adapt their liberal ideas to counter the fallacy in the previous generations. The next generation adapts those idea unconsciously. Today, with the rise of democracy and technology, we have an implosion of different ideas. Too much so that we come to accept that my truth may not be your truth. The world today is relative and subjective. You see here I’m making a very bold statement from experience and observation from the world around me that I say is true. It’s probably not until we analyze the history of philosophy. “There is a limit to our sensibility, we cannot construe objective reality because human being experience is subjective in itself and in relation to time and space.” This is an abstract critique taken from Immanuel Kant, a revolutionary philosopher to be said to have started the postmodernist movement. To get a different sense of things, let us look at academic critique from the supporters of the Enlightenment thinkers against postmodernism. “The Postmodernist view that we could structure our society is evolutionally wrong” or “Post-structuralism view that ideas are primary construct linguistic is incorrect, there’s no way to bridge the subject and the object.” If we look at the evolution of these mindsets, we tell that the enlightenment thinkers starting from the 15th century rejects the earlier medieval scholasticism because of the lack of rational foundation and the reliance on dogmatic teaching. Then there a change in trajectories in the 19th century, the postmodernist synthesis the teaching of scholasticism and enlightenment from the realization that we cannot rely on rational causality due to our limited cognitive capacity. We begin to reject rational and empirical thinking for a belief in faith. It could be seen as a degression to the medieval ages. One could make these claim from looking at history, but the problem is reducing our philosophical history to a few sentences. We reduce history into their appearance and the things-in-themselves fall out of our consciousness. When you think back on a subject you learn in school, what can you remember about it? Perhaps only the outlining and critical concept on the subject-matter. For philosophy, the same happens. Fascism is bad because of Hiliter. Marxism is bad because of the Soviet Union and China. But do you know the details of each doctrine? Doesn’t matter because we can attribute them to evil. It’s naive for us to criticizes an appearance. For example, you could reject the post-structuralist approach using evolution and biology. Society is not a linguistic structure when we have millions of years of evolution that prove otherwise. This is an incomplete argument. Let’s expand these through the eyes of a post-structurist, Michel Focualt. Foucault concludes from his research on anthropology that in each era; Ancient to Medieval to Modernity to Post-Modernity, each era view of ontology and epistemology is independent from each other, and this is reflected in the language they use to communicate. Can the former argument negates the latter when the latter is expended in detail (although still abstract-in-itself)? Not really. The case can be refuted when we categorize it monolithically. Secondly, we use a different scientific domain to critique another domain — Biology vs Linguistic. The most accurate method to refute Focualt is too out-Focualt him, but this requires intense research that could take years. This is quite impossible, especially for philosophy due to its nature of being meta-science. One could only posit ideas from refuting apparance. Or we could take Hegel approach of thesis, antithesis and synthesis where history is a lineaer regression in its totality, but looking at the mass killings in the 20th century, it doesnt seem to be the case that we are improving. Using each view of things, one could easily reach a conclusion where the truth is relative and subjective depending on the spatial-temporal variable. Your perception could be based on how I use positive or negative connotation. But this view is one of many. My method of critique is from Kant and Hegel, through a postmodernism lense. There are other ways of reasoning too. We can take Enlightenment philosophies such as Spinoza, Newton and Leibniz, where the universe can be explain using computation and mathematics. We will reach a different conclusion then.","link":"/2019/07/08/Critique-of-Postmodernism-through-a-Postmodernist-lens/"},{"title":"Inequality's Fallacy ","text":"Looking at inequality, we see that it is an issue in every economy. It’s a problem that we have to look that, but it’s much more complicated then you think. There are different lenses one can view from, and I’ll try to lay out some of them. If you’re a Marxist, you’ll see that inequality is increasing indefinitely. That’s the idea in the Soviet Union. Splitting the population into proletariat and bourgeois, compressing the wealth gap by massacring about 60 million people. One can argue that the situation is much more complicated then it seems, and it is much more complicated. To understand Marxism, one would have to understand Hegel as well, and Hegel is hard to decipher. The probability that the majority of the population understanding Hegel yet alone, Marx is probably zero. If you look at Kurnet curve, the period of transitioning between the agriculture era to the industrial age, you’ll see that that inequality is a U-shape curve, although future scholars have debunked that. Then we have to ask ourselves. Can we trust our empirical data to be reliable now knowing full well that it will be changed in the future? If you look at a simulated environment to test the distribution of inequality, you’ll see that the equilibrium of wealth when considering the individual’s saving propsensity is a Pareto distribution. But what we have here is just theoretical. If you look at history from the Stone Age to the Twenty-First Century, you see that the primary mode of inequality compression is through 4 violent means; Warfare, Revolution, State Failure and Pandemics.T If you look at the role of the government, it is to provide policy and legislative acts to balance inequality at a desirable level. But different political tribes hold different view on this matter. If you look at inequality, are you trying to solve absolute poverty or relative wealth? What’s you’re game? Are you trying to solve a psychological issue, or are you aiming at changing the empirical economic data? Now, you see that the problem is not as simple as you think. You can’t use a monolithic perspective to solve a multi-dimensional problem.Ask yourself then, where are you coming from? Are you trying to reduce suffering? Or is it coming from pity? Even worse, through anger and vengeance?Maybe it’s better to step back and look at yourself first. Perhaps it’s better to fix yourself than to try to fix the world’s problem.Who’s knows, you probably might do it wrong!","link":"/2019/06/25/Inequality-s-Fallacy/"},{"title":"Prejudice of Order & Nihilism","text":"There are places where we put ourselves in mentally on the idea of how we want to live our life. There is order; the place of comfort, the walls of culture, the perception of how society portrays your role according to your demographics, psychographic and ethnographic factors. Then, there is chaos, which is the land that lies outside the boundary of order. It is the place where the potential of exploration will take places. The area that elicits fear and curiosity. Here’s an analogy to what I’m saying to visualise. You are on an island. The island is your reality. The things that lies within the island may or may not be enough for the capacity for living. And there’s the infinite ocean that surrounds the island. It is infinite because you cannot see the end of it. Therefore it is infinite. There are times where you don’t notice the ocean. There are times where you look at the sea, but the fear of exploration stops you. The fear of drowning. There are times where your fear is replaced by curiosity, and you step into the water. Everyone has their island, in different mental places. The information that you feed yourselves is the foundation of your order, the sand below your feet. The island of order can shink and expand depending on the information you have so you move accordingly if you don’t want to drown and fall into nihilism. You have the move voluntarily; otherwise, you won’t move and you sink slowly and drown in your own reality. It a justified but sad way of living.","link":"/2019/06/19/Prejudice-of-Order-Nihilism/"},{"title":"The Quest for Truth","text":"The truth could be replace as rational thought, common sense (although I would argue not very common sense), some empirical data, metaphor, or an analogy to prove a certain point. But which methodology is closer to the truth? Maybe there’s a voice at the back of your head telling you otherwise? Perhaps you’re using someone else thoughts as your own without justifying it? The world is a complicated place beyond comprehension. We could possibly never have the capacity to understand the truth. We simplify, reduce, shorten the “truth” so could get our point across during a conversation/thought. To reach a point, we chain our thoughts into a sequential flow that makes sense. Imagine having someone break that chain of thought with another/opposing idea. Now you have to re-think. Now you have to have a debate to move forward. What if its something that has manifested in you so deeply close to your soul. Will you pull the “Well, it’s up to your interpretation” card? Aha! Someone caught you between your feet. You are not who you think you are. We may not be adapted for truth. We’re tribal, biased, emotional, irrational creatures. You have to work tirelessly to get to the truth. It isn’t easy, especially when we’re unsure how to define truth. How then? We explore… the quest of finding the truth.We’re starting from antiquity and work our way to the Now.","link":"/2019/06/22/The-Quest-for-Truth/"},{"title":"Thoughts on Rationally ","text":"The question I want to contend with is that of human rationality. First, we have the define our terminology. What do we mean by rationality? I lack the knowledge of the philosophical perspective of rationality so I need to catch up on that in the future, but let us define rationality in terms in game theory. There are several axioms in game theory, but as a summary; if I get to choose between $1 and $2, I should pick $2 … obviously. The same logic should be applied to other scenarios or object with our initial logic. There might be a few problems here. Is this the same as Aristotelian’s logic? And what is the evolution of logic theory? Does the example suffice? We can define rationally from another perspective. As conscience being, we are in control of our behaviour. There’s some problem with the definition here. We can say that there is a pre-define morality in every one of us that may be relative/absolute (We are not here to discuss this) or to put it in Kantian terms, a priori morality. Another view would be the existentialist view where it rejects the Kantian theory and expresses itself as existence before essence, men define men itself. We are responsible for our creation even though our environment, and psychological factor affects our behaviour, we choose our action and how we went to define ourselves. (Jean-Paul Sartre) Let’s say that our definition can compress all this view. But we know for sure that sometimes our emotions can overcome our rationality. It may be the case where I’m angry and choose to have a lose-lose situation, but what I’m a referencing to is beyond that. Sometimes, we act against our will or something we act without thinking of the consequences. From the psychoanalysis (Freudian?)/Nietzschean view, we have to contend with our desires. It runs deep into our soul and springs out whenever it gets suppressed to a certain extent. Not only are we rational, but we are also irrational. We have contend to with Dionysus. Here’s is where I turn to a more pragmatic view. We can build AI (artificial intelligence) in two different ways; the rule-based (ontological) or the pattern-based way (epistemology). We can look at the history of AI; the rule-based approach is unable to comprehend overly complicated problem because there are too many factors to consider (NP-Problem) and there are other subtle factors that are we’re not aware. We have resorted to the machine learning pattern-based approach. The problem lies on how to counter the inevitability of irrationally. How do we guide the machine to refute the probability of irrationally when we don’t understand consciousness ourselves? We can scale the problem down as a probability model on human behaviour, but our behaviour is a subset of our consciousness, we still need to tackle this problem, although it might not be a serious one now, it will be when we expect AI machine to run the world in the future. Further Research/Reading Aristotle’s Logic Post-Aristotle Classical Rationalism Nietzsche’s The Birth of Tragedy - the dichotomy of Apollonian and Dionysian Psychology of human behavior? Psychology of irrationality? Irrationality in game theory","link":"/2019/06/13/Thoughts-on-Rationally/"}],"tags":[{"name":"History","slug":"History","link":"/tags/History/"},{"name":"Religion","slug":"Religion","link":"/tags/Religion/"},{"name":"Ideas","slug":"Ideas","link":"/tags/Ideas/"},{"name":"Postmodernism","slug":"Postmodernism","link":"/tags/Postmodernism/"},{"name":"Economy","slug":"Economy","link":"/tags/Economy/"},{"name":"Inequality","slug":"Inequality","link":"/tags/Inequality/"},{"name":"Thoughts","slug":"Thoughts","link":"/tags/Thoughts/"},{"name":"Philosophy","slug":"Philosophy","link":"/tags/Philosophy/"},{"name":"Game-Theory","slug":"Game-Theory","link":"/tags/Game-Theory/"},{"name":"AI","slug":"AI","link":"/tags/AI/"}],"categories":[{"name":"Religion","slug":"Religion","link":"/categories/Religion/"},{"name":"Postmodernism","slug":"Postmodernism","link":"/categories/Postmodernism/"},{"name":"Economy","slug":"Economy","link":"/categories/Economy/"},{"name":"Philosophy","slug":"Philosophy","link":"/categories/Philosophy/"},{"name":"Thoughts","slug":"Thoughts","link":"/categories/Thoughts/"},{"name":"Thoughts","slug":"Economy/Thoughts","link":"/categories/Economy/Thoughts/"},{"name":"Thoughts","slug":"Philosophy/Thoughts","link":"/categories/Philosophy/Thoughts/"}]}